Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: After you make this addition to your `TokenSecuredResource`, rerun the `./mvnw quarkus:dev` command, and then try `curl -v http://127.0.0.1:8080/secured/roles-allowed; echo` to attempt to access the new endpoint.
ja_jp: `TokenSecuredResource` にこれを追加した後、 `./mvnw quarkus:dev` コマンドを再実行し、 `curl -v http://127.0.0.1:8080/secured/roles-allowed; echo` を実行して新しいエンドポイントへのアクセスを試みます。

source: After you make this addition to your `TokenSecuredResource`, try `curl -v http://127.0.0.1:8080/secured/roles-allowed; echo` to attempt to access the new endpoint. Your output should be:
ja_jp: `TokenSecuredResource` に追加後、 `curl -v http://127.0.0.1:8080/secured/roles-allowed; echo` を実行し、新しいエンドポイントへのアクセスを試してください。出力は次のようになるはずです:

source: After you run the build, there are a few extra files generated by the Quarkus lambda extension you are using. These files are in the build directory: `target/` for Maven, `build/` for Gradle.
ja_jp: ビルドを実行すると、Quarkus lambda エクステンションで生成されるいくつかの追加ファイルがあります。これらのファイルはビルドディレクトリーにあります: Maven なら `target/`、Gradle なら `build/` です。

source: After you run the build, there are a few extra files generated by the Quarkus lambda extension you are using. These files are in the the build directory: `target/` for Maven, `build/` for Gradle.
ja_jp: ビルドを実行すると、Quarkus lambda エクステンションで生成されるいくつかの追加ファイルがあります。これらのファイルはビルドディレクトリーにあります: Maven なら `target/`、Gradle なら `build/` です。

source: After you run the build, there are a few extra files generated by the `quarkus-amazon-lambda` extension. These files are in the build directory: `target/` for maven, `build/` for gradle.
ja_jp: ビルドを実行すると、 `quarkus-amazon-lambda` のエクステンションで生成されるいくつかの追加ファイルがあります。これらのファイルはビルドディレクトリーにあります: mavenなら `target/` 、gradleなら `build/` 。

source: After you run the build, there are a few extra files generated by the `quarkus-amazon-lambda` extension. These files are in the the build directory: `target/` for maven, `build/` for gradle.
ja_jp: ビルドを実行すると、 `quarkus-amazon-lambda` のエクステンションで生成されるいくつかの追加ファイルがあります。これらのファイルはビルドディレクトリーにあります: mavenなら `target/` 、gradleなら `build/` 。

source: After you run the build, there are a few extra files generated by the `quarkus-funqy-amazon-lambda` extension. These files are in the build directory: `target/` for maven, `build/` for gradle.
ja_jp: ビルドを実行すると、`quarkus-funqy-amazon-lambda` のエクステンションで生成されるいくつかの追加ファイルがあります。これらのファイルはビルドディレクトリーにあります: maven なら `target/`、gradleなら `build/`。

source: After you run the build, there are a few extra files generated by the `quarkus-funqy-amazon-lambda` extension. These files are in the the build directory: `target/` for maven, `build/` for gradle.
ja_jp: ビルドを実行した後、 `quarkus-funqy-amazon-lambda` エクステンションによって生成される追加ファイルがいくつかあります。これらのファイルはビルドディレクトリにあります: mavenの場合 `target/` 、gradleの場合 `build/` 。

source: After your PR is merged to `main` and the branch is synchronized with the link:https://github.com/quarkusio/quarkusio.github.io/tree/develop/_generated-doc[Quarkus.io] website repository, you can preview the resulting build output on the link:https://quarkus.io/version/main/guides/[Main branch (SNAPSHOT)] documentation page of the Quarkus site.
ja_jp: PRが `main` にマージされ、ブランチが link:https://github.com/quarkusio/quarkusio.github.io/tree/develop/_generated-doc[Quarkus.io] ウェブサイトのリポジトリと同期されると、Quarkusサイトの link:https://quarkus.io/version/main/guides/[Main branch (SNAPSHOT)] ドキュメントページで、結果のビルド出力をプレビューすることができます。

source: After your Quarkus project obtains information from `SERVICE_BINDING_ROOT` environment variables that are set by OpenShift, you can locate generated configuration files that are present in the file system and use them to map the configuration-file values to properties of certain extensions.
ja_jp: Quarkus プロジェクトが、OpenShift によって設定された `SERVICE_BINDING_ROOT` 環境変数から情報を取得した後、ファイルシステム内に存在する生成された設定ファイルを探し出し、設定ファイルの値を特定のエクステンションのプロパティーにマッピングするために使用することができます。

source: After your application accepts secure connections, the next step is to configure the `quarkus.http.ssl.certificate.trust-store-file` property with the name of that file that holds all the certificates your application trusts. The specified file also includes information about how your application asks for certificates when a client, such as a browser or other service, tries to access one of its protected resources.
ja_jp: アプリケーションが安全な接続を受け入れた後の次のステップは、アプリケーションが信頼するすべての証明書を保持するファイルの名前を使用して `quarkus.http.ssl.certificate.trust-store-file` プロパティーを設定することです。指定されたファイルには、ブラウザーやその他のサービスなどのクライアントが保護されたリソースの 1 つにアクセスしようとしたときに、アプリケーションが証明書を要求する方法に関する情報も含まれます。

source: After your application accepts secure connections, the next step is to configure the `quarkus.http.ssl.certificate.trust-store-file` property with the name of the file that holds all the certificates your application trusts. This file also includes information about how your application requests certificates when a client, such as a browser or another service, tries to access one of its protected resources.
ja_jp: アプリケーションがセキュアな接続を受け入れたら、次のステップは、アプリケーションが信頼するすべての証明書を保持するファイルの名前を使用して `quarkus.http.ssl.certificate.trust-store-file` プロパティーを設定することです。このファイルには、ブラウザーや他のサービスなどのクライアントが保護されたリソースの 1 つにアクセスしようとしたときに、アプリケーションが証明書を要求する方法に関する情報も含まれています。

source: After your application has been deployed with the debug enabled, next you need to tunnel the traffic from your local host machine to the specified port of the java agent:
ja_jp: デバッグを有効にした状態でアプリケーションをデプロイしたら、次に、ローカルホストマシンから java エージェントの指定されたポートにトラフィックをトンネルする必要があります。

source: After:
ja_jp: 変更後:

source: Afterwards, we will modify the deployment modules of `foo` and `bar`.
ja_jp: その後、`foo` と `bar` のデプロイメントモジュールを修正します。

source: Again we need to configure the incoming `quotes` channel inside `producer` project. Add the following inside `application.properties` file:
ja_jp: 再度、 `producer` プロジェクト内で `quotes` の受信チャンネルを設定する必要があります。 `application.properties` ファイル内に以下を追加します:

source: Again, be sure to replace `+${RJMX_PORT}+` on all lines with a port number in this file.
ja_jp: 繰り返しますが、このファイルでは、すべての行の `${RJMX_PORT}` をポート番号に置き換えてください。

source: Again, make sure to replace `yourAccountName` with your docker or quay account name when you run `docker push`.
ja_jp: 繰り返しになりますが、 `docker push` を実行する際には、 `yourAccountName` を docker または quay のアカウント名に置き換えてください。

source: Again, start an LRA using `curl` to send a request to the start method of the first service:
ja_jp: 再度、 `curl` を使用して LRA を起動し、最初のサービスの start メソッドにリクエストを送信します。

source: Again, this implementation is simplistic and just picks a random instance from the received list.
ja_jp: 繰り返しになりますが、この実装は単純過ぎるもので、受信したリストからランダムにインスタンスを選択するだけです。

source: Again, this implementation is simplistic. Typically, instead of creating a service instance with values from the configuration, you would connect to a service discovery backend, look for the service and build the list of service instances accordingly. That's why the method returns a `Uni`. Most of the time, the lookup is a remote operation.
ja_jp: 繰り返しになりますが、この実装は単純過ぎるものです。一般的には、設定から得た値でサービス・インスタンスを作成するのではなく、サービス・ディスカバリー・バックエンドに接続してサービスを探し、それに応じてサービス・インスタンスのリストを作成します。これが、このメソッドが `Uni` を返す理由です。ほとんどの場合、ルックアップはリモート操作で行われます。

source: Again, unlike with Avro, we have to define the `value.deserializer`.
ja_jp: ここでも、Avro とは異なり、`value.deserializer` を定義する必要があります。

source: Again, you may leave out `rest-client-reactive` if you're only going to use the dynamic client.
ja_jp: 繰り返しになりますが、ダイナミッククライアントのみを使用する場合は、 `rest-client-reactive` を省いても構いません。

source: Agroal - Database connection pool
ja_jp: Agroal - データベース接続プール

source: Agroal comes as a transitive dependency of the Hibernate ORM extension so if you are using Hibernate ORM, you don't need to add the Agroal extension dependency explicitly.
ja_jp: Agroal は Hibernate ORM 拡張の遷移依存関係として提供されるので、Hibernate ORM を使用している場合は、Agroal エクステンションの依存関係を明示的に追加する必要はありません。

source: Agroal is a modern, light weight connection pool implementation designed for very high performance and scalability, and features first class integration with the other components in Quarkus, such as security, transaction management components, health, and metrics.
ja_jp: Agroal は、非常に高いパフォーマンスとスケーラビリティ－を実現するように設計されたモダンで軽量な接続プールの実装です。また、セキュリティー、トランザクション管理コンポーネント、ヘルス、メトリクスなど、Quarkus における他のコンポーネントとのファーストクラスの統合を特徴としています。

source: Agroal is a modern, lightweight connection pool implementation designed for very high performance and scalability, and features first class integration with the other components in Quarkus, such as security, transaction management components, health, and metrics.
ja_jp: Agroal は、非常に高いパフォーマンスとスケーラビリティ－を実現するように設計されたモダンで軽量な接続プールの実装です。また、セキュリティー、トランザクション管理コンポーネント、ヘルス、メトリクスなど、Quarkus における他のコンポーネントとのファーストクラスの統合を特徴としています。

source: Aha, so there's only one path and that's a virtual call (i.e., an interface call) that comes from the `create` method in the `org.acme.hibernate.orm.FruitResource` class, which takes a `org.acme.hibernate.orm.Fruit` parameter and returns a `javax.ws.rs.core.Response`.
ja_jp: それは、 `org.acme.hibernate.orm.FruitResource` クラスの `create` メソッドから来る仮想呼び出し（つまり、インターフェース呼び出し）で、 `org.acme.hibernate.orm.Fruit` パラメータを受け取り、 `javax.ws.rs.core.Response` を返します。

source: Ahead-of-Time (AOT) Caching
ja_jp: Ahead-of-Time (AOT) キャッシング

source: Alert class to hold information of the potential detected problems:
ja_jp: 問題が発生する可能性のあると検出された情報を保持するアラートクラス:

source: Alerts are modeled around the Bootstrap alerts. Click https://getbootstrap.com/docs/4.0/components/alerts[here] for more info.
ja_jp: アラートはBootstrapアラートをモデルにしています。詳しくは link:https://getbootstrap.com/docs/4.0/components/alerts[こちら] をクリックしてください。

source: Aliases
ja_jp: エイリアス

source: Aliases are available and accessible in the keystores and truststores.
ja_jp: エイリアスがキーストアとトラストストアで使用可能であり、アクセスできる。

source: All <<request-parameters,Request Parameters>> can be declared as link:{jdkapi}/java/lang/String.html[`String`], but also any of the following types:
ja_jp: すべての<<request-parameters,リクエストパラメーター>> は link:{jdkapi}/java/lang/String.html[`String`] として宣言することができます。しかし、それだけでなく、次のいずれかの型でも宣言できます。

source: All <<request-parameters,Request Parameters>> can be declared as link:{jdkapi}/java/lang/String.html[`String`], but also as any of the following types:
ja_jp: すべての <<request-parameters,リクエストパラメーター>> は link:{jdkapi}/java/lang/String.html[`String`] として宣言できますが、以下のいずれかの型としても宣言できます。

source: All BuildItems
ja_jp: すべてのビルドアイテム

source: All Builditems
ja_jp: すべてのビルドアイテム

source: All CDI beans implementing the `InfoContributor` will be picked up and their data will be appended to the endpoint.
ja_jp: `InfoContributor` を実装する全ての CDI Bean がピックアップされ、そのデータがエンドポイントに追加されます。

source: All Configuration Properties
ja_jp: すべての設定プロパティ

source: All HTTP calls that have not been stubbed are handled by calling the real service. This is done for demonstration purposes, as it is not something that would usually happen in a real test.
ja_jp: スタブ化されていないすべての HTTP 呼び出しは、実際のサービスを呼び出すことで処理されます。これはデモンストレーションを目的として行われているものであり、通常は実際のテストでは発生しません。

source: All HTTP requests to the `/basic-only` path from the `basicTestMethod` test are authenticated successfully.
ja_jp: `basicTestMethod` テストからの `/basic-only` パスへのすべての HTTP リクエストが正常に認証されます。

source: All Java frameworks relying on introspection have challenges using top level classes as they are not as visible as public classes; and in Java there can only be one top level public class in a file.
ja_jp: イントロスペクションに依存する全てのJavaフレームワークは、トップレベルクラスがパブリッククラスのようなアクセス修飾子を持たないため、トップレベルクラスを使用することに課題があります。そして Java では、1つのファイルにトップレベルのパブリッククラスは1つしか記述できません。

source: All Java primitives and their wrapper classes
ja_jp: すべての Java プリミティブとそのラッパークラス

source: All Quarkus applications are created by the QuarkusBootstrap class in the `independent-projects/bootstrap` module. This class is used to resolve all the relevant dependencies (both deployment and runtime) that are needed for the Quarkus application. The end result of this process is a `CuratedApplication`, which contains all the class loading information for the application.
ja_jp: すべての Quarkus アプリケーションは、 `independent-projects/bootstrap` モジュールの QuarkusBootstrap クラスによって作成されます。このクラスは、Quarkus アプリケーションに必要なすべての関連する依存関係(デプロイメントとランタイムの両方)を解決するために使用されます。このプロセスの最終結果は、 `CuratedApplication` であり、これにはアプリケーションのすべてのクラスロード情報が含まれています。

source: All Quarkus core converters use the priority value of `200`. To override any Quarkus specific converter, the priority value should be higher than `200`.
ja_jp: すべてのQuarkusコアコンバーターは、 `200` の優先値を使用しています。Quarkus特有のコンバーターをオーバーライドするには、優先度の値を `200` よりも高くする必要があります。

source: All Qute files paired with a corresponding Java resource support a number of language client features, such as go to definition, hover, autocompletion, etc.. Each of these we will explore further in the article
ja_jp: 対応するJavaリソースと組み合わされた全てのQuteファイルは、定義への移動、ホバー、オートコンプリートなど、多くの言語クライアント機能をサポートしています。これらの各機能については、記事でさらに詳しく説明します。

source: All Qute files paired with a corresponding Java resource supports a number of language client features, such as go to definition, hover, autocompletion, etc.. Each of these we will explore further in the article.
ja_jp: 対応するJavaリソースと組み合わされた全てのQuteファイルは、定義への移動、ホバー、オートコンプリートなど、多くの言語クライアント機能をサポートしています。これらのそれぞれについて、記事の中でさらに掘り下げていきます。

source: All `@Dao`-annotated interfaces in your project, as long as they are produced by a corresponding `@DaoFactory`-annotated method declared in a mapper interface from your project.
ja_jp: プロジェクト内のすべての `@Dao` アノテーション付きインターフェイス。ただし、このインターフェイスは、プロジェクトのマッパーインターフェイスで宣言されており、対応する `@DaoFactory` アノテーション付きメソッドによって生成されている場合に限ります。

source: All `@Mapper`-annotated interfaces in your project.
ja_jp: プロジェクト内にある `@Mapper` アノテーション付きインターフェイスすべて。

source: All `health` REST endpoints return a simple JSON object with two fields:
ja_jp: すべての `health` RESTエンドポイントは、2つのフィールドを持つシンプルなJSONオブジェクトを返します:

source: All `list` methods have equivalent `stream` versions.
ja_jp: すべての `list` メソッドは、同等の `stream` バージョンがあります。

source: All about delegation
ja_jp: デリゲーションに関するすべて

source: All available customization options are available in the xref:deploying-to-kubernetes.adoc#openshift[OpenShift configuration options].
ja_jp: 利用可能なカスタマイズオプションは、すべて xref:deploying-to-kubernetes.adoc#openshift[OpenShift設定オプション]で利用できます。

source: All beans implementing `ValidatorFactoryCustomizer` are applied, meaning you can have several of them. If you need to enforce some ordering, you can use the usual `@jakarta.annotation.Priority` annotation - beans with higher priority are applied first.
ja_jp: `ValidatorFactoryCustomizer` を実装するすべての Bean が適用されます。つまり、複数の Bean を持つことができます。もし、何らかの順序付けが必要な場合は、通常の `@jakarta.annotation.Priority` アノテーションを使用することができます - より高い優先順位の Bean が最初に適用されます。

source: All beans implementing `ValidatorFactoryCustomizer` are applied, meaning you can have several of them. If you need to enforce some ordering, you can use the usual `@javax.annotation.Priority` annotation - beans with higher priority are applied first.
ja_jp: `ValidatorFactoryCustomizer` を実装する全ての Bean が適用されるので、複数の Bean を持つことができます。 もし、何らかの順序付けが必要な場合は、通常の `@javax.annotation.Priority` アノテーションを使用することができます - より高い優先度を持つ Bean が最初に適用されます。

source: All builders now use static factory methods instead of public constructors. This provides better encapsulation and follows modern Java best practices:
ja_jp: すべてのビルダーは、パブリックコンストラクターの代わりに静的ファクトリーメソッドを使用するようになりました。これにより、カプセル化が向上し、最新のJavaのベストプラクティスに従うことができます。

source: All cached queries are by default kept in a single region dedicated to them called `default-query-results-region`.
ja_jp: すべてのキャッシュされたクエリは、デフォルトでは、 `default-query-results-region` と呼ばれる一つの専用の領域に保存されます。

source: All chat applications need a _nice_ UI, well, this one may not be that nice, but does the work. Quarkus automatically serves static resources contained in the `META-INF/resources` directory. Create the `src/main/resources/META-INF/resources` directory and copy this link:{quickstarts-blob-url}/websockets-next-quickstart/src/main/resources/META-INF/resources/index.html[index.html] file in it.
ja_jp: すべてのチャットアプリケーションには _洗練された_ UIが必要です。これは、それほど洗練されていないかもしれませんが、十分に機能します。 Quarkusは、`META-INF/resources` ディレクトリーに含まれる静的リソースを自動的に提供します。 `src/main/resources/META-INF/resources` ディレクトリーを作成し、この link:{quickstarts-blob-url}/websockets-next-quickstart/src/main/resources/META-INF/resources/index.html[index.html] ファイルをそこへコピーします。

source: All chat applications need a _nice_ UI, well, this one may not be that nice, but does the work. Quarkus automatically serves static resources contained in the `META-INF/resources` directory. Create the `src/main/resources/META-INF/resources` directory and copy this link:{quickstarts-blob-url}/websockets-quickstart/src/main/resources/META-INF/resources/index.html[index.html] file in it.
ja_jp: すべてのチャットアプリケーションには _素敵な_ UIが必要です。 Quarkusは、 `META-INF/resources` ディレクトリに含まれる静的リソースを自動的に提供します。 `src/main/resources/META-INF/resources` ディレクトリを作成し、この link:{quickstarts-blob-url}/websockets-quickstart/src/main/resources/META-INF/resources/index.html[index.html] ファイルをコピーしてください。

source: All chat applications need a _nice_ UI, well, this one may not be that nice, but does the work. Quarkus automatically serves static resources contained in the `META-INF/resources` directory. Create the `src/main/resources/META-INF/resources` directory and copy this {quickstarts-blob-url}/websockets-quickstart/src/main/resources/META-INF/resources/index.html[index.html] file in it.
ja_jp: すべてのチャットアプリケーションには _素敵な_ UIが必要です。Quarkusは、 `META-INF/resources` ディレクトリーに含まれる静的リソースを自動的に提供します。 `src/main/resources/META-INF/resources` ディレクトリーを作成し、この {quickstarts-blob-url}/websockets-quickstart/src/main/resources/META-INF/resources/index.html[index.html] ファイルをコピーします。

source: All classes annotated with `picocli.CommandLine.Command` are registered as CDI beans.
ja_jp: `picocli.CommandLine.Command` でアノテーションされたクラスはすべて CDI Bean として登録されています。

source: All communication to the backend happens with https://www.jsonrpc.org/[JsonRPC] over web socket. Dev UI makes this easy to use for extension developers, and you do not really need to get into the details of either JsonRPC or Web Sockets.
ja_jp: バックエンドとのすべての通信は、ウェブソケットを介した https://www.jsonrpc.org/[JsonRPC] で行われます。Dev UI は、エクステンション開発者にとってこれを使いやすくしており、JsonRPC や Web ソケットのいずれかの詳細に深く踏み込む必要はありません。

source: All configuration options
ja_jp: すべての設定オプション

source: All configurations have been updated from `quarkus.opentelemetry.\*` -> `quarkus.otel.*`
ja_jp: すべての設定は、 `quarkus.opentelemetry.*` から `quarkus.otel.*` に更新されています。

source: All configurations under the `"%test"` key activate only when the `test` profile is enabled. For instance, the previous snippet shows that OpenID Connect (OIDC) (`quarkus.oidc.enabled: false`) is disabled when the `test` profile is active. Without the `test` profile, OIDC is enabled by default.
ja_jp: `"%test"` キーの下にあるすべての設定は、 `test` プロファイルが有効になっているときにのみ有効になります。 例えば、前述のスニペットでは、 `test` プロファイルが有効な場合、OpenID Connect (OIDC) ( `quarkus.oidc.enabled: false` ) は無効になっています。 `test` プロファイルがない場合、OIDC はデフォルトで有効になります。

source: All declarative REST Client instances produce metrics using the `http.clients` prefix. Furthermore, the metrics contain a tag named `clientName` which corresponds to the config key of the client (as specified by the `configKey` property of the `@RegisterRestClient` annotation).
ja_jp: すべての宣言型 REST Client インスタンスは、`http.clients` プレフィックスを使用してメトリクスを生成します。さらに、メトリクスには `clientName` というタグが含まれており、これはクライアントのコンフィグキー (`@RegisterRestClient` アノテーションの `configKey` プロパティーで指定) に対応します。

source: All defined channels are enabled by default, but it is possible to disable a channel with the configuration:
ja_jp: 定義されたすべてのチャネルはデフォルトで有効化されていますが、以下の設定でチャネルを無効化することもできます。

source: All dev services using the old API start in the JUnit discovery phase (as of Quarkus 3.22). This is because they are started during https://quarkus.io/guides/reaugmentation#what-is-augmentation[the augmentation phase], along with bytecode manipulation and other application initialization steps. When the testing design changed, all augmentation happened at the beginning of the test run, during the JUnit discovery phase. This means all Dev Services also start at the beginning of the test run. If several test classes with different Dev Service configuration are augmented before any tests are run, multiple differently-configured Dev Services may be running at the same time.
ja_jp: 旧 API を使用するすべての Dev Services は、(Quarkus 3.22 以降) JUnit のディスカバリーフェーズで開始されます。これは、それらがバイトコード操作や他のアプリケーション初期化ステップとともに、 https://quarkus.io/guides/reaugmentation#what-is-augmentation[オーグメンテーションフェーズ] 中に開始されるためです。テストの設計が変更された際、すべてのオーグメンテーションはテスト実行の開始時、つまり JUnit のディスカバリーフェーズ中に行われるようになりました。これは、すべての Dev Services もテスト実行の開始時に開始されることを意味します。異なる Dev Services 設定を持つ複数のテストクラスがテスト実行前にオーグメンテーションされると、設定の異なる複数の Dev Services が同時に実行される可能性があります。

source: All documentation should be generated and validated before being commited.
ja_jp: すべてのドキュメントは、コミットされる前に生成され、検証されるべきです。

source: All documentation should be generated and validated before being committed.
ja_jp: すべてのドキュメントは、コミットされる前に生成され、検証される必要があります。

source: All documents should start with a Title (a `= Level 0` heading), and should be broken into subsections as appropriate (`== Level 1` to `====== Level 5`) without skipping any levels.
ja_jp: すべての文書はタイトル ( `= Level 0` の見出し) で始まり、レベルを飛ばすことなく適切なサブセクション ( `= Level 1` から `= Level 5` ) に分割されなければなりません。

source: All done! Navigate to http://localhost:8080/fruits.html and read/create/delete some fruits.
ja_jp: すべて完了! http://localhost:8080/fruits.html に移動し、いくつかの fruits を読み取り/作成/削除します。

source: All endpoints are now running on the IO thread by default. You can use `@Blocking` to change that.
ja_jp: デフォルトではすべてのエンドポイントが IO スレッド上で実行されます。 `@Blocking` を使えばこれを変更出来ます。

source: All executions should be in the same `<plugin>` definition so make sure you concatenate all of them.
ja_jp: すべてのexecutionsは同じ `<plugin>` の定義にあるはずなので、すべてつなげてください。

source: All expressions are validated against the types of the parameters; e.g. `Hello {foo.bar}` where the parameter `foo` is of type `org.acme.Foo` -> `org.acme.Foo` must have a property of name `bar`
ja_jp: すべての式は、パラメーターのタイプに対して検証されます。たとえば、パラメーター `foo` のタイプが `org.acme.Foo` -> `org.acme.Foo` である `Hello {foo.bar}` 場合、`bar` という名前のプロパティーを持つ必要があります。

source: All expressions with `cdi` and `inject` namespaces are validated during build.
ja_jp: `cdi` および `inject` の名前空間を持つすべての式は、ビルド時に検証されます。

source: All expressions with `cdi` and `inject` namespaces are validated during build. For the expression `cdi:personService.findPerson(10).name` the implementation class of the injected bean must either declare the `findPerson` method or a matching <<template_extension_methods,template extension method>> must exist. For the expression `inject:foo.price` the implementation class of the injected bean must either have the `price` property (e.g. a `getPrice()` method) or a matching <<template_extension_methods,template extension method>> must exist.
ja_jp: 名前空間 `cdi` と `inject` を含むすべての式は、ビルド時に検証されます。 `cdi:personService.findPerson(10).name` という式では、注入される Bean の実装クラスは `findPerson` メソッドを宣言しているか、マッチする<<template_extension_methods,テンプレート拡張メソッド>> が存在しなければなりません。 `inject:foo.price` という式では、注入される Bean の実装クラスは `price` プロパティー (例: `getPrice()` メソッド) を持つか、マッチする <<template_extension_methods,テンプレート拡張メソッド>> が存在しなければなりません。
